window.allNews = [
            {
                id: "03-05-2026",
                date: "3 мая, 2026 года",
                title: "Новая эра Kaeront: Безопасность, Лицензирование и Глобальная Экосистема",
                tags: [{n: "Важное", c: "tag-red"}, {n: "Сайт", c: "tag-blue"}, {n: "Сервера", c: "tag-blue"}],
                content: "Мы объявляем о начале масштабной реструктуризации проекта. С 1-го числа следующего месяца <b>поддержка нелицензионных (пиратских) клиентов будет полностью прекращена</b> на всех серверах Kaeront. Данная мера является вынужденным шагом для формирования качественного комьюнити: мы стремимся отсечь деструктивные элементы, отдавая приоритет осознанным и интеллектуальным игрокам.<br><br>Вместе с этим мы внедряем <b>единую систему аккаунтов Kaeront</b>. Это позволит объединить все сервисы в одну экосистему. В связи с переходом на автоматизированную систему, старые Google-формы закрываются — теперь подача заявок и управление профилем будут осуществляться в улучшенном виде непосредственно на сайте <a href=\".\">kaeront.ru</a>.<br><br>Помните, что Kaeront находится в фазе активной разработки, где даже один час работы может привести к фундаментальным изменениям кода и концепции. Несмотря на то, что сейчас проект только начинает свой путь и еще не оброс стабильной аудиторией, мы строим фундамент, который не терпит компромиссов в качестве."
            },
            {
                id: "26-04-2026",
                date: "26 апреля, 2026 года",
                title: "Отчет о разработке FYGHTING: Бойцы и Автоматизация",
                tags: [{n: "FYGHTING", c: "tag-gold"}],
                content: "Разработка нашего шутера движется полным ходом. На текущий момент полностью завершены механики трех файтеров (fyghters): <b>Rocket, Bag и Hammer</b> — их геймплей отточен и готов к тестам. Параллельно мы ведем глубокую проработку лора, который свяжет персонажей и мир FYGHTING в единую историю.<br><br>С технической стороны внедрена <b>система динамической выгрузки карт</b>: теперь игровые локации подгружаются только в момент матча, что минимизирует нагрузку на глобальный мир. Уже полностью готовы 3 карты с уникальным дизайном. Также обновлено ядро обработки способностей, что позволило сократить задержку практически до нуля. Мы продолжаем полировать детали, чтобы на выходе получить продукт высшего качества."
            },
            {
                id: "30-03-2026",
                date: "30 марта, 2026 года",
                title: "Присоединение к Kaeront",
                tags: [{n: "Важное", c: "tag-red"}, {n: "Сайт", c: "tag-blue"}, {n: "Сервера", c: "tag-blue"}],
                content: "К Kaeront присоединились прочие Minecraft-проекты от KAmir, такие как: FYGHTING, STRYKE и Matchmaking. Прошлые новости этих проектов уже дополняются в страницу с новостями <a href=\"news\">kaeront.ru/news</a>."
            },
            {
                id: "28-03-2026",
                date: "28 марта, 2026 года",
                title: "Всё ещё немного работаем над FYGHTING!",
                tags: [{n: "FYGHTING", c: "tag-gold"}],
                content: "Мы сфокусировались на наших режимах игры FYGHTING и скоро их доделаем! Ну а пока, мы сделали наши фирменные музыкальные треки! Также, уже готово лобби, где вы можете прогуляться на улице, подождать начала следующей игры, или просто отдохнуть со своими приятелями в спикизи \"The Black Key Lounge\". Только, пожалуйста, не распространяйте их кодовое слово..."
            },            
            {
                id: "24-03-2026",
                date: "24 марта, 2026 года",
                title: "Улучшенная страница новостей",
                tags: [{n: "Сайт", c: "tag-blue"}],
                content: "Мы полностью обновили страницу с новостями! Раньше была простая лента новостей: без фильтров, поиска, с небольшими лагами. Но теперь, на <a href=\"news\">kaeront.ru/news</a> есть умный поиск, фильтры и оптимизированные карточки новостей, чтобы не нагружать ваше устройство. В дальнейшем планируется навигация по страницам и рассылка."
            },
            {
                id: "12-03-2026",
                date: "12 марта, 2026 года",
                title: "Технические работы остановлены",
                tags: [{n: "Включение", c: "tag-green"}, {n: "Сервера", c: "tag-blue"}],
                content: "Мы завершили технические работы! Теперь на Kaeront: Hub (который уже завершён) можно зайти по адресу <b>play.kaeront.ru</b>. Имейте в виду, что сервера всё ещё работают \"когда как\". У нас, пока нет денег на качественное железо, чтобы сервера были активны постоянно."
            },
            {
                id: "11-03-2026",
                date: "11 марта, 2026 года",
                title: "Мы переезжаем!",
                tags: [{n: "Сайт", c: "tag-blue"}, {n: "Сервера", c: "tag-blue"}],
                content: "Проект Kaeront переехал на новый домен! Теперь, <a href=\"./\">kaeront.ru</a> будет единой точкой всего проекта."
            },
            {
                id: "09-03-2026",
                date: "9 марта, 2026 года",
                title: "Технические работы",
                tags: [{n: "Отключение", c: "tag-dark-red"}, {n: "Важное", c: "tag-red"}, {n: "Сервера", c: "tag-blue"}],
                content: "Проект Kaeront временно меняет формат! Мы приостанавливаем работу всех наших серверов, чтобы сосредоточиться на технической части и качественным, стабильным доступом к серверам, однако нет поводов для грусти — всего за сутки наш Hub был завершен на 90% и уже готов встречать первых игроков. Работа над сетевой частью уже кипит, и совсем скоро закончится."
            },
            {
                id: "08-03-2026",
                date: "8 марта, 2026 года",
                title: "Открытие официального сайта",
                tags: [{n: "Важное", c: "tag-red"}, {n: "Сайт", c: "tag-blue"}],
                content: "Добро пожаловать в наш новый цифровой дом! Теперь следить за прогрессом разработки, подавать заявки на Survival и поддерживать проект можно в одном месте. Сайт будет дополняться новыми функциями по мере развития Хаба."
            },
            {
                id: "04-03-2026",
                date: "4 марта, 2026 года",
                title: "Мы переименовались в Kaeront",
                tags: [{n: "Важное", c: "tag-red"}],
                content: "Мы официально меняем название на <b>Kaeront</b>. Это решение связано с расширением нашей инфраструктуры и подготовкой к запуску глобальной сети серверов."
            },
            {
                id: "23-02-2026",
                date: "23 февраля, 2026 года",
                title: "Чувствуете запах выпечки?",
                tags: [{n: "AlsasnikS", c: "tag-gold"}],
                content: "Мы делаем классный датапак/ресурспак <b>Cuisine</b>, который добавит нам новые предметы, связанные с кулинарией! Инструменты, материалы, продукты и блюда подходят на AlsasnikS!"
            },
            {
                id: "22-02-2026",
                date: "22 февраля, 2026 года",
                title: "Ачивочное выживание",
                tags: [{n: "AlsasnikS", c: "tag-gold"}],
                content: "Скоро на AlsasnikS появятся новые ачивки и квесты! У нас, пока, готово 30 ачивок (много!). Помимо простых ачивок мы добавили испытания, с которыми вы с ума сойдёте..."
            },
            {
                id: "14-09-2025",
                date: "14 сентября, 2025 года",
                title: "💎 РАННИЙ ДОСТУП ЗАПУЩЕН! Стань первооткрывателем AlsasnikS!",
                tags: [{n: "AlsasnikS", c: "tag-gold"}, {n: "Ранний доступ", c: "tag-green"}],
                content: "Пришло время написать историю вместе! Мы запускаем ранний доступ, и у тебя есть уникальный шанс стать одним из первых жителей этого мира и повлиять на его развитие с самого НУЛЯ.<br>Сейчас онлайн пуст — все лучшие локации для строительства, все ресурсы и вся слава первооткрывателей ждут именно тебя!<br>Почему это круто?<ul><li>Первым занять легендарный стартовый участок.</li><li>Помочь отточить баланс до массового запуска.</li><li>Заложить основы дружелюбного комьюнити.</li></ul><p><br>Мы ждем тех, кто:</p><ul><li>Ценит ванильное выживание с легкой антуражной атмосферой.</li><li>Хочет стать частью чего-то большего с самого начала.</li><li>Готов делиться идеями и обратной связью.</li></ul><p><br>🚀 Как присоединиться?</p><ol><li>Подай заявку: <ссылка скрыта></li><li>Изучи информацию и правила: <ссылка скрыта></li><li>Получи одобрение и заселяйся!</li></ol><p><br>Встретимся в игре! 💙</p>"
            },
            {
                id: "12-05-2025",
                date: "12 мая, 2025 года",
                title: "Новость от 12 мая 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"},{n: "STRYKE: Карты", c: "tag-black-gold"}],
                content: "Началась разработка новых карт на летний сезон и операцию \"Shipment\"!<ul><li>Новые карты (6): Apartment, Sumekien, Shipped, Mira, Nuke, Rust</li><li>Карты сезона (8): Port, Pebble, Street, Sandeqer, Villa, Apartment, Sumekien, Shipped</li><li>Карты операции (6): Port, Pier, Shipped, Mira, Nuke, Rust</li></ul>"
            },
            {
                id: "01-05-2025",
                date: "1 мая, 2025 года",
                title: "Новость от 1 мая 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"},{n: "STRYKE: Карты", c: "tag-black-gold"}],
                content: "[ КАРТЫ ]<ul><li>Villa<ul><li>Тестирование карты</li></ul></li></ul>"
            },
            {
                id: "27-04-2025",
                date: "27 апреля, 2025 года",
                title: "Новость от 27 апреля 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"},{n: "STRYKE: Карты", c: "tag-black-gold"}],
                content: "Идёт разработка новой карты Villa — Роскошный прибрежный особняк, окружённый буйной тропической растительностью."
            },
            {
                id: "24-04-2025",
                date: "24 апреля, 2025 года",
                title: "Обновление от 24 апреля 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"}, {n: "STRYKE: Игровой процесс", c: "tag-black-gold"}, {n: "STRYKE: Карты", c: "tag-black-gold"}],
                content: "[ ИГРОВОЙ ПРОЦЕСС ]<ul><li>Игроки теперь ускорены на 15%</li></ul><br><p>[ КАРТЫ ]</p><ul><li>Sandeqer<ul><li>Небольшие изменения в геометрии</li></ul></li></ul>"
            },
            {
                id: "15-04-2025",
                date: "15 апреля, 2025 года",
                title: "Обновление от 15 апреля 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"}, {n: "STRYKE: Игровой процесс", c: "tag-black-gold"}, {n: "STRYKE: Карты", c: "tag-black-gold"}, {n: "STRYKE: Предстоящее", c: "tag-black-gold"}],
                content: "[ ИГРОВОЙ ПРОЦЕСС ]<ul><li>Исправление критических ошибок</li></ul><br><p>[ ПРЕДСТОЯЩЕЕ ]</p><ul><li>Улучшение меню закупки</li><li>Очистка карты от предметов в начале фазы подготовки</li><li>Выдача стартовых денег в начале матча, половины и в каждом отрезке овертайма</li></ul>"
            },
            {
                id: "14-04-2025",
                date: "14 апреля, 2025 года",
                title: "Обновление от 14 апреля 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"}, {n: "STRYKE: Игровой процесс", c: "tag-black-gold"}],
                content: "[ ИГРОВОЙ ПРОЦЕСС ]<ul><li>Добавлена система перерывов.</li></ul>"
            },
            {
                id: "13-04-2025",
                date: "13 апреля, 2025 года",
                title: "Обновление от 13 апреля 2025 года",
                tags: [{n: "STRYKE", c: "tag-gold"}, {n: "STRYKE: Игровой процесс", c: "tag-black-gold"}],
                content: "[ ИГРОВОЙ ПРОЦЕСС ]<ul><li>Добавлена система формирования команд:<ul><li>Алгоритм автоматического распределения игроков</ul></li></li><li>Добавлена система смены сторон команд</li><li>Добавлена система овертаймов</li><li>Добавлена система завершения матча</li><li>Новые scoreboard-переменные:<ul><li>\"changeat\" — количество раундов, необходимых для автоматической смены сторон</li><li>\"winat\" — количество раундов, необходимых для победы в матче командой</li></ul></li><li>Новые функции:<ul><li>\"matchmaking:teams/changeside\" — сменить стороны команд игроков</li><li>\"matchmaking:teams/jointeams\" — распределить игроков по командам</li><li>\"matchmaking:teams/kickteams\" — выгнать игроков с команд</li></ul></li></ul>"
            }
        ];